using System;
namespace TodaysManna
{
    public static class MyExtensions
    {
        public static int WordCount(this String str)
        {
            return str.Split(new char[] { ' ', '.', '?' },
                             StringSplitOptions.RemoveEmptyEntries).Length;
        }

        public static string ToHexString(this Xamarin.Forms.Color color)
        {
            var red = (int)(color.R * 255);
            var green = (int)(color.G * 255);
            var blue = (int)(color.B * 255);
            var alpha = (int)(color.A * 255);
            var hex = $"#{alpha:X2}{red:X2}{green:X2}{blue:X2}";

            return hex;
        }

        public static string BibleBookKorToEng(this string str)
        {
            return str switch
            {
                "창" => "Gen",
                "출" => "exo",
                "레" => "Lev",
                "민" => "Num",
                "신" => "DEU",
                "수" => "JOS",
                "삿" => "jdg",
                "룻" => "RUT",
                "삼상" => "1SA",
                "삼하" => "2SA",
                "왕상" => "1KI",
                "왕하" => "2KI",
                "대상" => "1CH",
                "대하" => "2CH",
                "스" => "ezr",
                "느" => "Neh",
                "에" => "Est",
                "욥" => "Job",
                "시" => "PSA",
                "잠" => "PRO",
                "전" => "Ecc",
                "아" => "SNG",
                "사" => "Isa",
                "렘" => "Jer",
                "애" => "Lam",
                "겔" => "Ezk",
                "단" => "Dan",
                "호" => "Hos",
                "욜" => "JOL",
                "암" => "AMO",
                "옵" => "Oba",
                "욘" => "jon",
                "미" => "Mic",
                "나" => "Nam",
                "합" => "Hab",
                "습" => "Zep",
                "학" => "Hag",
                "슥" => "Zec",
                "말" => "Mal",
                "마" => "Mat",
                "막" => "MRK",
                "눅" => "LUK",
                "요" => "JHN",
                "행" => "ACT",
                "롬" => "Rom",
                "고전" => "1CO",
                "고후" => "2CO",
                "갈" => "Gal",
                "엡" => "Eph",
                "빌" => "PHP",
                "골" => "Col",
                "살전" => "1Th",
                "살후" => "2Th",
                "딤전" => "1TI",
                "딤후" => "2TI",
                "딛" => "Tit",
                "몬" => "PHM",
                "히" => "Heb",
                "약" => "Jas",
                "벧전" => "1PE",
                "벧후" => "2PE",
                "요일" => "1Jn",
                "요이" => "2Jn",
                "요삼" => "3Jn",
                "유" => "JUD",
                "계" => "Rev",
                _ => "Gen",
            };
        }

        public static string ToShortBible(this string str)
        {
            return str switch
            {
                "창세기" => "창",
                "출애굽기" => "출",
                "레위기" => "레",
                "민수기" => "민",
                "신명기" => "신",
                "여호수아" => "수",
                "사사기" => "삿",
                "룻기" => "룻",
                "사무엘상" => "삼상",
                "사무엘하" => "삼하",
                "열왕기상" => "왕상",
                "열왕기하" => "왕하",
                "역대상" => "대상",
                "역대하" => "대하",
                "에스라" => "스",
                "느헤미야" => "느",
                "에스더" => "에",
                "욥기" => "욥",
                "시편" => "시",
                "잠언" => "잠",
                "전도서" => "전",
                "아가" => "아",
                "이사야" => "사",
                "예레미야" => "렘",
                "예레미야 애가" => "애",
                "에스겔" => "겔",
                "다니엘" => "단",
                "호세아" => "호",
                "요엘" => "욜",
                "아모스" => "암",
                "오바댜" => "옵",
                "요나" => "욘",
                "미가" => "미",
                "나훔" => "나",
                "하박국" => "합",
                "스바냐" => "습",
                "학개" => "학",
                "스가랴" => "슥",
                "말라기" => "말",
                "마태복음" => "마",
                "마가복음" => "막",
                "누가복음" => "눅",
                "요한복음" => "요",
                "사도행전" => "행",
                "로마서" => "롬",
                "고린도전서" => "고전",
                "고린도후서" => "고후",
                "갈라디아서" => "갈",
                "에베소서" => "엡",
                "빌립보서" => "빌",
                "골로새서" => "골",
                "데살로니가전서" => "살전",
                "데살로니가후서" => "살후",
                "디모데전서" => "딤전",
                "디모데후서" => "딤후",
                "디도서" => "딛",
                "빌레몬서" => "몬",
                "히브리서" => "히",
                "야고보서" => "약",
                "베드로전서" => "벧전",
                "베드로후서" => "벧후",
                "요한일서" => "요일",
                "요한이서" => "요이",
                "요한삼서" => "요삼",
                "유다서" => "유",
                "요한계시록" => "계",
                _ => str
            };
        }
    }
}
